<!-- placeholder-1 -->
```fish
terraform plan -chdir=. -refresh=true
```
<!-- placeholder-2 -->

<details open><summary>Diff of 8 changes.</summary>

```diff
+ tailscale_tailnet_key.key will be created
! terraform_data.tailscale_node_deletion_hook[0] will be updated in-place
+ time_rotating.rotate_tailnet_key will be created
+ module.ubuntu_dev_vm.proxmox_virtual_environment_file.cloud_config will be created
+ module.ubuntu_dev_vm.proxmox_virtual_environment_vm.ubuntu_dev_vm will be created
+ module.ubuntu_dev_vm.random_password.ubuntu_vm_password will be created
+ module.ubuntu_dev_vm.random_pet.ubuntu_pet will be created
+ module.ubuntu_dev_vm.tls_private_key.ubuntu_vm_key will be created
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 7 to add, 1 to change, 0 to destroy.</br>

<!-- placeholder-4 -->
###### By @b- at 2025-07-18T22:58:32Z [(view log)](https://github.com/perchnet/p/actions/runs/16381849929/job/46294794204#step:11:1).
</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # tailscale_tailnet_key.key will be created
  + resource "tailscale_tailnet_key" "key" {
      + created_at    = (known after apply)
      + ephemeral     = false
      + expires_at    = (known after apply)
      + expiry        = 3600
      + id            = (known after apply)
      + invalid       = (known after apply)
      + key           = (sensitive value)
      + preauthorized = true
      + reusable      = true
      + tags          = [
          + "tag:periphery",
        ]
      + user_id       = (known after apply)
    }

  # terraform_data.tailscale_node_deletion_hook[0] will be updated in-place
  ~ resource "terraform_data" "tailscale_node_deletion_hook" {
        id               = "aa300efb-c501-faee-8c42-30d09544594b"
      ~ input            = (sensitive value)
      ~ output           = [
          - "nhx2BCDuzD11CNTRL",
          - "tskey-api-kT2hP9xx1q11CNTRL-WsZavyFZxparwB3nWmostakswfYDyqF1",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # time_rotating.rotate_tailnet_key will be created
  + resource "time_rotating" "rotate_tailnet_key" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_minutes = 60
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.ubuntu_dev_vm.proxmox_virtual_environment_file.cloud_config will be created
  + resource "proxmox_virtual_environment_file" "cloud_config" {
      + content_type           = "snippets"
      + datastore_id           = "snippets"
      + file_modification_date = (known after apply)
      + file_name              = (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      + id                     = (known after apply)
      + node_name              = "pve1"
      + overwrite              = true
      + timeout_upload         = 1800

      + source_raw {
          + data      = (sensitive value)
          + file_name = "example.cloud-config.yaml"
          + resize    = 0
        }
    }

  # module.ubuntu_dev_vm.proxmox_virtual_environment_vm.ubuntu_dev_vm will be created
  + resource "proxmox_virtual_environment_vm" "ubuntu_dev_vm" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + migrate                 = false
      + name                    = "ubuntu-dev"
      + network_interface_names = (known after apply)
      + node_name               = "pve1"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + reboot_after_update     = true
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = true
      + stop_on_destroy         = true
      + tablet_device           = true
      + tags                    = [
          + "terraform",
          + "ubuntu",
          + "tailscale",
          + "docker",
          + "dev",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = (known after apply)

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cpu {
          + cores      = 3
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "host"
          + units      = 1024
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "zssd"
          + discard           = "ignore"
          + file_format       = "raw"
          + import_from       = "zssd-files:iso/ubuntu-22_TFimg-d4a5.04-server-cloudimg-amd64.img"
          + interface         = "scsi0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 8
          + ssd               = false
        }

      + initialization {
          + datastore_id         = "zssd-files"
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          + user_data_file_id    = (known after apply)
          + vendor_data_file_id  = (known after apply)

          + ip_config {
              + ipv4 {
                  + address = "dhcp"
                }
            }

          + user_account {
              + keys     = (known after apply)
              + password = (sensitive value)
              + username = "ubuntu"
            }
        }

      + memory {
          + dedicated      = 4096
          + floating       = 4096
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + serial_device {
          + device = "socket"
        }

      + tpm_state {
          + datastore_id = "zssd"
          + version      = "v2.0"
        }

      + vga (known after apply)

      + virtiofs {
          + cache        = "always"
          + direct_io    = true
          + expose_acl   = false
          + expose_xattr = false
          + mapping      = "rust-root"
        }
    }

  # module.ubuntu_dev_vm.random_password.ubuntu_vm_password will be created
  + resource "random_password" "ubuntu_vm_password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "_%@"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.ubuntu_dev_vm.random_pet.ubuntu_pet will be created
  + resource "random_pet" "ubuntu_pet" {
      + id        = (known after apply)
      + keepers   = {
          + "ssh_public_key" = (known after apply)
        }
      + length    = 2
      + separator = "-"
    }

  # module.ubuntu_dev_vm.tls_private_key.ubuntu_vm_key will be created
  + resource "tls_private_key" "ubuntu_vm_key" {
      + algorithm                     = "ED25519"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

Plan: 7 to add, 1 to change, 0 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- terraform-39-3eee8c84341b95e00d4d4dd1307a8268.tfplan -->
<!-- placeholder-6 -->